{
  "introduccion": {
    "texto": "隆Atenci贸n, j贸venes programadores! \nImagina que eres un/a inventor/a de gadgets de 煤ltima generaci贸n. Necesitas que tu dispositivo micro:bit pueda recordar y gestionar una secuencia de datos, como una lista de puntuaciones, una serie de comandos de un robot, o una galer铆a de animaciones LED. 驴C贸mo almacenas m煤ltiples elementos de forma ordenada en una sola \"caja\" de datos?\nLa respuesta est谩 en los Arreglos (o Arrays). Esta WebQuest te guiar谩 para que descubras qu茅 son, c贸mo se usan en MakeCode y c贸mo aplicarlos en tu micro:bit para resolver un desaf铆o de programaci贸n. Puedes hacerlo individual o en equipo.",
    "objetivo": "Comprender y aplicar el concepto de arreglos en programaci贸n, utilizando MakeCode para crear un proyecto funcional en micro:bit."
  },
  "tarea": {
    "descripcion": "Tu misi贸n es crear una \"Caja de Sorpresas Digital\" para la micro:bit.",
    "requisitos": [
      "Almacene al menos cinco elementos diferentes (p. ej., n煤meros, im谩genes LED, o nombres) en un arreglo.",
      "Muestre un elemento aleatorio de ese arreglo en la pantalla LED de la micro:bit al presionar el bot贸n A.",
      "Permita agregar un nuevo elemento al arreglo al presionar el bot贸n B.",
      "Presentar una breve demostraci贸n del c贸digo y explicar con tus palabras (en un informe o presentaci贸n) c贸mo el arreglo hace posible el proyecto."
    ]
  },
  "proceso": {
    "fases": [
      {
        "titulo": "Paso 1: Investigaci贸n y Configuraci贸n del Arreglo",
        "actividades": [
          {
            "nombre": "A. 隆A Investigar!",
            "descripcion": "Utiliza los recursos para comprender qu茅 es un Arreglo (Array), qu茅 son los 铆ndices y la longitud. Identifica los bloques de Arreglos en MakeCode (Crear, Obtener y A帽adir)."
          },
          {
            "nombre": "B. Crea tu Arreglo",
            "descripcion": "Abre un nuevo proyecto en MakeCode. En el bloque al iniciar, crea un Arreglo (ll谩malo Sorpresas) e inicial铆zalo con al menos 5 铆conos o n煤meros diferentes (los elementos de tu caja)."
          }
        ]
      },
      {
        "titulo": "Paso 2: Programaci贸n de la Caja de Sorpresas y Presentaci贸n",
        "actividades": [
          {
            "nombre": "A. Programar Bot贸n A",
            "descripcion": "En el bloque al presionar bot贸n A: usa bloques de matem谩ticas para generar un n煤mero aleatorio que sea un 铆ndice v谩lido (piensa en la longitud del arreglo). Luego, ten en cuenta el 铆ndice para obtener y mostrar el elemento de la Sorpresa en la pantalla LED."
          },
          {
            "nombre": "B. Programar Bot贸n B",
            "descripcion": "En el bloque al presionar bot贸n B: usa el bloque para a帽adir un nuevo elemento (una sorpresa extra) a tu arreglo Sorpresas. Muestra un mensaje breve (\"隆Nuevo!\") en la pantalla para confirmar."
          },
          {
            "nombre": "C. Prueba y Demuestra",
            "descripcion": "Prueba el c贸digo en el simulador o en la micro:bit. Aseg煤rate de que el Bot贸n B realmente a帽ada la sorpresa para que el Bot贸n A pueda mostrarla despu茅s. Prepara tu breve demostraci贸n final y la explicaci贸n de c贸mo funciona el arreglo."
          }
        ]
      }
    ]
  },
  "recursos": [
    {
      "titulo": "MakeCode para micro:bit - Editor Oficial",
      "descripcion": "Plataforma recomendada para programar tu micro:bit con bloques",
      "url": "https://makecode.microbit.org/",
      "placeholder": false
    },
    {
      "titulo": "Arreglos en MakeCode",
      "descripcion": "Referencia sobre c贸mo trabajar con arreglos en MakeCode",
      "url": "https://newtoncbraga.com.mx/curso-de-electronica/102-micro-bit/30592-arreglos-arrays-con-micro-bit-mic069s",
      "placeholder": false
    },
    {
      "titulo": "Arreglos - Conceptos, Tipos y Caracter铆sticas",
      "descripcion": "Aprende los conceptos b谩sicos de los arreglos en programaci贸n",
      "url": "https://msmk.university/array-en-programacion-concepto-tipos-y-ejemplos/",
      "placeholder": false
    },
    {
      "titulo": "Arreglos con MakeCode",
      "descripcion": "Acercamiento sencillo a los arreglos mediante bloques en MakeCode",
      "url": "https://makecode.microbit.org/types/array",
      "placeholder": false
    },
    {
      "titulo": "Video Tutorial: Introducci贸n a Arrays con MakeCode",
      "descripcion": "Video explicativo sobre el concepto de arreglos en el entorno de MakeCode",
      "url": "https://youtu.be/VK6POqoSpwo",
      "placeholder": false
    }
  ],
  "evaluacion": {
    "criterios": [
      {
        "criterio": "Comprensi贸n del concepto de Arreglo",
        "descripcion": "Demuestra entender qu茅 es un arreglo y sus caracter铆sticas (铆ndice, longitud, elementos)",
        "puntajeMaximo": 1
      },
      {
        "criterio": "Creaci贸n e inicializaci贸n del arreglo",
        "descripcion": "Crea correctamente un arreglo con al menos 5 elementos en el c贸digo",
        "puntajeMaximo": 2
      },
      {
        "criterio": "Funci贸n Bot贸n A (Elemento aleatorio)",
        "descripcion": "Implementa correctamente la funci贸n para mostrar un elemento aleatorio del arreglo",
        "puntajeMaximo": 1
      },
      {
        "criterio": "Funci贸n Bot贸n B (A帽adir elemento)",
        "descripcion": "Implementa correctamente la funci贸n para a帽adir nuevos elementos al arreglo",
        "puntajeMaximo": 1
      },
      {
        "criterio": "Funcionamiento del c贸digo",
        "descripcion": "El c贸digo funciona sin errores en el simulador o dispositivo real",
        "puntajeMaximo": 2
      },
      {
        "criterio": "Presentaci贸n y documentaci贸n",
        "descripcion": "Presenta el c贸digo y explica claramente c贸mo se utilizan los arreglos",
        "puntajeMaximo": 2
      },
      {
        "criterio": "Trabajo en equipo (si aplica)",
        "descripcion": "Colaboraci贸n y distribuci贸n equitativa del trabajo",
        "puntajeMaximo": 1
      }
    ],
    "totalMaximo": 10
  },
  "conclusion": {
    "texto": "隆Felicitaciones!  Has desbloqueado el poder de los Arreglos. Ahora puedes organizar grandes cantidades de datos en una colecci贸n bajo un mismo nombre, haciendo tu c贸digo m谩s eficiente, din谩mico y potente. Esta es una habilidad fundamental que te servir谩 en cualquier lenguaje de programaci贸n futuro.\n隆Sigue explorando y programando! 驴Qu茅 otros proyectos podr铆as crear con arreglos? 驴Podr铆as crear un juego de memoria o un reproductor de m煤sica? 隆El l铆mite es tu imaginaci贸n!"
  },
  "creditos": {
    "autor": "Creado por: Alex Cuadro",
    "fecha": "Fecha: Octubre 2025",
    "agradecimientos": "Recursos utilizados de MakeCode, micro:bit Educational Foundation y la MSMK university. Estructura basada en el Genially compartido en CREA."
  }
}
